{
  "todos": [
    {
      "title": "Buy Groceries",
      "description": "Buying groceries is a regular and important task in everyone’s life. It ensures that we have the necessary food and household items to get through the week. Most people make a shopping list before heading to the store to stay organized. A good list helps avoid buying unnecessary things and keeps spending within budget. Many choose to shop once a week, while others prefer smaller, more frequent trips. Grocery shopping can happen in supermarkets, local markets, or even online these days. Some people enjoy browsing the aisles and discovering new products. Others prefer to get in and out quickly with only the essentials. Fresh produce like fruits and vegetables is often a top priority. Dairy, meat, rice, and snacks also fill up most shopping carts. It's important to check expiration dates before buying anything. Comparing prices and looking for discounts helps save money. Some stores offer loyalty programs for regular customers. Eco-conscious shoppers often bring reusable bags and avoid plastic. Shopping during less busy hours can make the experience faster and more pleasant. Online grocery apps now allow people to order from home and get items delivered. For large families, buying in bulk is often more economical. Planning meals ahead of time makes grocery shopping more efficient. It’s also a great way to maintain a healthy diet. Overall, grocery shopping is a simple task, but when done right, it supports a healthier, more organized lifestyle.",
      "id": "1"
    },
    {
      "title": "Buy Groceries",
      "description": "Buying groceries is a regular and important task in everyone’s life. It ensures that we have the necessary food and household items to get through the week. Most people make a shopping list before heading to the store to stay organized. A good list helps avoid buying unnecessary things and keeps spending within budget. Many choose to shop once a week, while others prefer smaller, more frequent trips. Grocery shopping can happen in supermarkets, local markets, or even online these days. Some people enjoy browsing the aisles and discovering new products. Others prefer to get in and out quickly with only the essentials. Fresh produce like fruits and vegetables is often a top priority. Dairy, meat, rice, and snacks also fill up most shopping carts. It's important to check expiration dates before buying anything. Comparing prices and looking for discounts helps save money. Some stores offer loyalty programs for regular customers. Eco-conscious shoppers often bring reusable bags and avoid plastic. Shopping during l",
      "id": "4409"
    }
  ]
}